[NoCoverage] BlockStatement
GitHub/online-calculators/src/App.js:4:16
 import logo from './logo.svg';
 import './App.css';
 
-function App() {
-  return (
-    <div className="App">
-      <header className="App-header">
-        <img src={logo} className="App-logo" alt="logo" />
-          <p className="App-name">
-              Онлайн Калькуляторы на все случаи жизни!
-          </p>
-      </header>
-        <body>
-
-        </body>
-        <footer className="App-footer">
-
-        </footer>
-    </div>
-  );
-}
+function App() {}
 
 export default App;
