[Killed] BlockStatement
src/calculators/matrix/matris.tsx:6:52
 }
 
 class MatrixCalculator {
-    static Add = (a: Matrix, b: Matrix): Matrix => {
-        if (a.data.length !== b.data.length)
-            throw "Matrix dimensions differ"
-        
-        return {data: a.data.map((ai, i) => ai.map((aij, j) => aij + b.data[i][j]))};
-    }
+    static Add = (a: Matrix, b: Matrix): Matrix => {}
 }
 
killedBy: Matrix tests Addition 1x1 + 1x1
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/calculators/matrix/matris.tsx:7:13
 
 class MatrixCalculator {
     static Add = (a: Matrix, b: Matrix): Matrix => {
-        if (a.data.length !== b.data.length)
+        if (a.data.length === b.data.length)
             throw "Matrix dimensions differ"
         
killedBy: Matrix tests Addition 1x1 + 1x1
statusReason: Error: thrown: "Matrix dimensions differ"

[Killed] ConditionalExpression
src/calculators/matrix/matris.tsx:7:13
 
 class MatrixCalculator {
     static Add = (a: Matrix, b: Matrix): Matrix => {
-        if (a.data.length !== b.data.length)
+        if (true)
             throw "Matrix dimensions differ"
         
killedBy: Matrix tests Addition 1x1 + 1x1
statusReason: Error: thrown: "Matrix dimensions differ"

[Killed] ArithmeticOperator
src/calculators/matrix/matris.tsx:10:64
         if (a.data.length !== b.data.length)
             throw "Matrix dimensions differ"
         
-        return {data: a.data.map((ai, i) => ai.map((aij, j) => aij + b.data[i][j]))};
+        return {data: a.data.map((ai, i) => ai.map((aij, j) => aij - b.data[i][j]))};
     }
 }
killedBy: Matrix tests Addition 1x1 + 1x1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] ArrowFunction
src/calculators/matrix/matris.tsx:10:34
         if (a.data.length !== b.data.length)
             throw "Matrix dimensions differ"
         
-        return {data: a.data.map((ai, i) => ai.map((aij, j) => aij + b.data[i][j]))};
+        return {data: a.data.map(() => undefined)};
     }
 }
killedBy: Matrix tests Addition 1x1 + 1x1
statusReason: TypeError: Cannot read properties of undefined (reading '0')
