[NoCoverage] StringLiteral
GitHub/online-calculators/src/index.js:11:27
   <React.StrictMode>
     <App />
   </React.StrictMode>,
-  document.getElementById('root')
+  document.getElementById("")
 );
 
