[NoCoverage] LogicalOperator
GitHub/online-calculators/src/reportWebVitals.js:2:7
 const reportWebVitals = onPerfEntry => {
-  if (onPerfEntry && onPerfEntry instanceof Function) {
+  if (onPerfEntry || onPerfEntry instanceof Function) {
     import('web-vitals').then(({ getCLS, getFID, getFCP, getLCP, getTTFB }) => {
       getCLS(onPerfEntry);
